/*
В С се използва библиотека за сортиране. Принципно имаме:
Selection Sort Сортиране чрез пряка селекция O(n^2)
  -Намира най-малкия елемент и го слага на първа позиция, търси най-малкия лелемент за следщата позиция.
  Не е ефективен, подходящ за малки масиви.
Binary Sort Пирамидално сортиране  O(n log n)
  - Масивърт се представя като т.нар Двоично дърво. Намира най-малкия и най-големия елемент и ги
  поставя в двата края, след което прави същото за останлите елементи.
  Има голяма времева ефективност.
Merge Sort (Сортиране чрез сливане )    O(n log(n)) 
  - Най-бързия. Репетативен алгоритъм тип "Разделяй и владей". Разделя всички елементи, сравнява ги два по два и ги обединява.
  Двойките се сравняват и се разменят ако е нужно. Обединяват се в четворки и отново се сравняват. 
  Повтаря се докато се обединят всички елементи. Подходящ за големи масиви.
Radix Sort (Сортиране чрез броене)     O(nk)
  - Само за цели числа, сравнява първо единиците на числата, после десетиците, следват стотиците и тн.
  Скоростта зависи от големината на числата. 
Insertion Sort  O(n^2)
  - Сравнява  линейно всеки елемент с всеки от елементите в подредената лява част на масива.
  Подходящ за по-малки масиви. 

Намерете разликите между методите и кой кога е най-бърз.
*/