/*
Направете функцията :
void copy(char *to, char *from), която копира една
последователност от символи в друга. Декларирайте масива,
който ще копирате така char *from = "abcdef" или така char from[]
= "abcdef" това е едно и също. Първото е пойнтер, сочещ към
низова константа, второто е началото на масив, сочещ към нея.
Заделете място за масива, в който ще копирате тези символи с
декларация
char to[16]; Копирайте символ по символ масива from[] в to[],
докато не стигнете знака '\0' терминираща нула – знак за край на
стринг. Терминиращият символ '\0' има стойност 0.
*/
#include <stdio.h>

int RecursiveFun(int nA, int nB);

int main() {
printf("RecursiveFun: %d\n", RecursiveFun(5, 7));
}

int RecursiveFun(int nA, int nB) {
int nValue = 1;
if (nA > 1 && nB > 1) {
    nValue += RecursiveFun(nA - 1, nB - 1);
    } /* сумира числата, докато и двете са по-големи от 1 */
    return (nA + nB + nValue);
}