/*
Дефинирайте масив int с 10 елемента. Дефинирайте
пойнтер, който ще сочи към масива. 
Насочете пойнтера към масива. 

Дефинирайте едномерен масив int с 10 елемента =
{100,90,80,70,60,50,40,30,20,10} Дефинирайте пойнтер, който ще сочи към
масива.
Достъпете 3 тия елемент от масива и му задайте стойност 5.
Достъпете 4 тия елемент и му задайте стойност 33.
Достъпете 5 тия елемент и го намалете със 7.
Достъпете 7 мия елемент и го увеличете с 10.
Достъпете 10 тия елемент и го умножете по 3.
Изпишете го по двата възможни начина и закоментирайте единия.
Принтирайте на екрана всички елементи на масива.
*/

#include <stdio.h>

int printArr(int a[], int l);

int main() {
    int arr[10] = {100,90,80,70,60,50,40,30,20,10};
    int *p = NULL;
    //p=&arr[0];
    p=arr;
    p[2]=5;
    p[3]=33;
    p[4]-=7;
    p[6]+=10;
    p[9]*=3;
    



  int arrLenght =  (sizeof(arr)/sizeof(arr[0])-1);
  printArr(arr, arrLenght); 
  return 0;
}

int printArr(int a[], int l){
    for(int i=0; l>=0; i++, l--)
      printf("%d\n", a[i]);
    return 0;
}
