/*
Дефинирайте масив int с 10 елемента. Дефинирайте
пойнтер, който ще сочи към масива. 
Насочете пойнтера към масива. 

Нужно ли е да използвате &? 
  О:Не е грешно да се използва, но не е нужно.
Какво представлява името на масива? Какво сочи?
  О: Самото име на масива с пойтер и сочи към първия елемент. 
Колко начина има за да изпишете насочването на пойнтера към масива?
  O: Вариант е да се присвой адреса на първия елемент с &.
    Вариант е и да вземе адреса директно като се присвои името на масива.
Има ли разлика между тях?
  O: Двата начина са равностойни.
*/

#include <stdio.h>

int main() {
    int arr[10] = {100,90,80,70,60,50,40,30,20,10};
    int *p = NULL;
    p=&arr[0];

  printf("p=&arr[0]  %p\np=arr  %0p\n",&arr[0], p=arr); 
  return 0;
}
