/*
Напишете програма, която сумира всички елементи на масив
намиращи се на четна позиция:
int arr[10] = {23, 91, 36, 4, 9, 99, 87, 11, 2, 33};
Декларирайте пойнтер към първата нечетна позиция, инкрементирайте
пойнтера по подходящ начин, за да извършите сумирането.

*/

#include <stdio.h>

int sumEven( int *a, int len);

int main(void){
    int arr[10] = 
    {23, 91, 36, 4, 9, 99, 87, 11, 2, 33}; 
    printf("%d", sumEven(arr, 10));
    return 0;
}

int sumEven( int *a, int len){
    int i, sum=0;
    for (i=0; i<len; i+=2){
        sum += *(a+i);
   }
   return sum;
}
