/*
Какво е грешното на този код?

При всяка итерация на for цикъла, се присвоява стойност на нулевата позиция,
към която сочи пойтера. За да работи първо трябва да се изпълни привояването на стойност,
след това да се инкрементира пойнтера към следващта поция в низа.
*/

#include <stdio.h>
int our_strcmp(char *s, char *t);

int main(void){
    char str[] = {'H','e','l','l','o','\0'};
    char str2[100];
    our_strcmp(str,str2);
    return 0;
}

int our_strcmp(char *s, char *t){
    //for(; (*s = *t); t++, s++) //->работещ вариант
    for(; *t; t++, s++) 
        *s = *t;
        printf("%c", *s);
}
